In [2]:
import numpy as np 
import pandas as pd

In [3]:
raw_scorecard = pd.read_csv('MERGED2013_PP.csv',na_values="PrivacySuppressed")

In [4]:
# INSTNM: Institution name
# CITY: City
# STABBR: State postcode
# region: Region (IPEDS)
# UGDS: Enrollment of undergraduate degree-seeking students
# UG: Enrollment of all undergraduate students
# COSTT4_A: Average cost of attendance (academic year institutions)
# COSTT4_P: Average cost of attendance (program-year institutions)\
# DEBT_MDN: The original amount of the loan principal upon entering repayment
# GRAD_DEBT_MDN: The median debt for students who have completed
# WDRAW_DEBT_MDN: The median debt for students who have not completed
# count_nwne_p10: Number of students not working and not enrolled 10 years after entry
# mn_earn_wne_p10: Mean earnings of students working and not enrolled 10 years after entry
# md_earn_wne_p10: Median earnings of students working and not enrolled 10 years after entry
# mn_earn_wne_p6
# md_earn_wne_p6
# DEBT_MDN_SUPP: Median debt, suppressed for n=30
filtered_series = pd.Series(np.array(['INSTNM','CITY','STABBR','region','UGDS','UG','NPT4_PUB','NPT4_PRIV','COSTT4_A','COSTT4_P','DEBT_MDN','GRAD_DEBT_MDN','WDRAW_DEBT_MDN','count_nwne_p10','mn_earn_wne_p10','md_earn_wne_p10','DEBT_MDN_SUPP']))
filtered_series_nums = pd.Series(np.array(['UGDS','UG','NPT4_PUB','NPT4_PRIV','COSTT4_A','COSTT4_P','DEBT_MDN','GRAD_DEBT_MDN','WDRAW_DEBT_MDN','count_nwne_p10','mn_earn_wne_p10','md_earn_wne_p10','DEBT_MDN_SUPP']))
filtered_scorecard = raw_scorecard[filtered_series]
filtered_scorecard

,INSTNM,CITY,STABBR,region,UGDS,UG,NPT4_PUB,NPT4_PRIV,COSTT4_A,COSTT4_P,DEBT_MDN,GRAD_DEBT_MDN,WDRAW_DEBT_MDN,count_nwne_p10,mn_earn_wne_p10,md_earn_wne_p10,DEBT_MDN_SUPP
0,Alabama A & M University,Normal,AL,5,4051.0,NaN,13415.0,NaN,18888.0,NaN,19500.0,33611.5,14250.0,NaN,NaN,NaN,19500.0
1,University of Alabama at Birmingham,Birmingham,AL,5,11200.0,NaN,14805.0,NaN,19990.0,NaN,16250.0,23117.0,11886.0,NaN,NaN,NaN,16250.0
2,Amridge University,Montgomery,AL,5,322.0,NaN,NaN,7455.0,12300.0,NaN,10500.0,26995.0,9500.0,NaN,NaN,NaN,10500.0
3,University of Alabama in Huntsville,Huntsville,AL,5,5525.0,NaN,17520.0,NaN,20306.0,NaN,16500.0,24738.0,10500.0,NaN,NaN,NaN,16500.0
4,Alabama State University,Montgomery,AL,5,5354.0,NaN,11936.0,NaN,17400.0,NaN,15854.5,33452.0,12500.0,NaN,NaN,NaN,15854.5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7799,Georgia Military College-Columbus Campus,Columbus,GA,5,NaN,NaN,NaN,NaN,NaN,NaN,6076.0,10500.0,5500.0,NaN,NaN,NaN,6076.0
7800,Georgia Military College-Valdosta Campus,Valdosta,GA,5,NaN,NaN,NaN,NaN,NaN,NaN,6076.0,10500.0,5500.0,NaN,NaN,NaN,6076.0
7801,Georgia Military College-Warner Robins Campus,Warner Robins,GA,5,NaN,NaN,NaN,NaN,NaN,NaN,6076.0,10500.0,5500.0,NaN,NaN,NaN,6076.0
7802,Georgia Military College-Online,Milledgeville,GA,5,NaN,NaN,NaN,NaN,NaN,NaN,6076.0,10500.0,5500.0,NaN,NaN,NaN,6076.0
7803,Georgia Military College-Stone Mountain,Stone Mountain,GA,5,NaN,NaN,NaN,NaN,NaN,NaN,6076.0,10500.0,5500.0,NaN,NaN,NaN,6076.0

In [8]:
filtered_scorecard[filtered_series_nums] = filtered_scorecard[filtered_series_nums].apply(pd.to_numeric)

In [13]:
# means
filtered_scorecard[filtered_series_nums].mean().round(decimals=2)

UGDS                2332.78
UG                      NaN
NPT4_PUB            9583.52
NPT4_PRIV          18071.81
COSTT4_A           24353.67
COSTT4_P           18494.88
DEBT_MDN           11829.78
GRAD_DEBT_MDN      16906.35
WDRAW_DEBT_MDN      7660.60
count_nwne_p10          NaN
mn_earn_wne_p10         NaN
md_earn_wne_p10         NaN
DEBT_MDN_SUPP      11860.14
dtype: float64

In [14]:
# medians 
filtered_scorecard[filtered_series_nums].median().round(decimals=2)

UGDS                 432.5
UG                     NaN
NPT4_PUB            8792.0
NPT4_PRIV          18259.0
COSTT4_A           22865.0
COSTT4_P           17831.0
DEBT_MDN            9833.0
GRAD_DEBT_MDN      14144.0
WDRAW_DEBT_MDN      6772.5
count_nwne_p10         NaN
mn_earn_wne_p10        NaN
md_earn_wne_p10        NaN
DEBT_MDN_SUPP       9833.0
dtype: float64

In [17]:
# means separated by regions
filtered_scorecard.groupby(['region'])[filtered_series_nums].mean().round(decimals=2)

,UGDS,UG,NPT4_PUB,NPT4_PRIV,COSTT4_A,COSTT4_P,DEBT_MDN,GRAD_DEBT_MDN,WDRAW_DEBT_MDN,count_nwne_p10,mn_earn_wne_p10,md_earn_wne_p10,DEBT_MDN_SUPP
region,,,,,,,,,,,,,
0,958.00,NaN,4275.00,NaN,6603.00,NaN,4000.00,4211.00,NaN,NaN,NaN,NaN,4000.00
1,1950.56,NaN,12354.85,22486.54,33191.08,20997.73,13383.27,16938.81,7959.86,NaN,NaN,NaN,13413.67
2,2181.66,NaN,12001.71,18887.34,28122.56,19700.16,12634.52,16694.23,7829.79,NaN,NaN,NaN,12679.18
3,2190.37,NaN,9976.71,18039.26,25030.60,18036.65,12285.85,17675.52,7673.16,NaN,NaN,NaN,12302.75
4,1915.75,NaN,10983.61,17491.50,23714.61,17516.03,12615.67,18421.02,8213.82,NaN,NaN,NaN,12619.59
5,2256.85,NaN,8578.44,17548.54,22735.48,17400.53,11602.27,18083.18,7769.87,NaN,NaN,NaN,11661.30
6,2799.20,NaN,7963.91,17597.57,20978.70,18639.85,10357.73,15278.78,6863.06,NaN,NaN,NaN,10247.46
7,2252.18,NaN,10506.79,17211.84,21943.45,17259.07,11210.90,17158.56,7380.37,NaN,NaN,NaN,11168.93
8,3002.25,NaN,8202.50,19415.44,24587.94,20054.54,11358.81,14946.89,7660.69,NaN,NaN,NaN,11435.28
9,1567.08,NaN,4698.42,6646.62,11178.83,10883.71,5661.23,7946.50,4856.35,NaN,NaN,NaN,5815.13

In [18]:
# medians separated by regions
filtered_scorecard.groupby(['region'])[filtered_series_nums].median().round(decimals=2)

,UGDS,UG,NPT4_PUB,NPT4_PRIV,COSTT4_A,COSTT4_P,DEBT_MDN,GRAD_DEBT_MDN,WDRAW_DEBT_MDN,count_nwne_p10,mn_earn_wne_p10,md_earn_wne_p10,DEBT_MDN_SUPP
region,,,,,,,,,,,,,
0,958.0,NaN,4275.0,NaN,6603.0,NaN,4000.0,4211.00,NaN,NaN,NaN,NaN,4000.0
1,576.5,NaN,12268.0,21951.0,31101.0,19190.5,10767.0,14675.25,7763.00,NaN,NaN,NaN,10892.0
2,427.0,NaN,12039.0,18109.0,24323.5,18757.0,10750.0,13725.25,6844.00,NaN,NaN,NaN,10861.0
3,336.0,NaN,9501.0,18904.0,24375.0,17430.0,10500.0,15312.00,6548.00,NaN,NaN,NaN,10559.0
4,463.0,NaN,10951.0,18242.0,22820.0,16582.5,11588.5,17285.00,8250.00,NaN,NaN,NaN,11588.5
5,504.0,NaN,8018.5,17940.0,22347.0,16848.5,10250.0,16655.25,7300.00,NaN,NaN,NaN,10296.0
6,350.0,NaN,7778.0,18180.0,20212.5,18114.0,9500.0,11991.50,5815.25,NaN,NaN,NaN,9500.0
7,275.0,NaN,10131.0,17790.0,21932.0,17332.5,9972.0,14072.00,7124.00,NaN,NaN,NaN,9888.5
8,461.5,NaN,7532.0,19195.0,22833.5,19185.0,9500.0,12000.00,6334.00,NaN,NaN,NaN,9500.0
9,569.5,NaN,3785.5,6196.0,11103.5,11073.0,5500.0,7516.50,5325.00,NaN,NaN,NaN,5500.0